In [1]:
from sqlalchemy import create_engine, MetaData, table

In [2]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
database = create_engine(connection_string)

In [4]:
import pandas as pd

nulls in lat, testing

In [5]:
# Vs this:
query = '''
SELECT COUNT(latitude)
FROM scooters;
'''

result = database.execute(query)

In [6]:
lat = pd.read_sql(query, con = database)
lat.head()

      count
0  73414043

In [7]:
lat_null = '''
SELECT COUNT(*)
FROM scooters
WHERE latitude IS NULL;
'''
result = database.execute(lat_null)

In [8]:
num_of_nulls_in_lat = pd.read_sql(lat_null, con = database)
num_of_nulls_in_lat.head()

   count
0      0

- Are there any null values in any columns in either table?

What date range is represented in each of the date columns? Investigate any values that seem odd.

In [9]:
min_date = '''
SELECT MIN(startdate)
FROM trips;
'''

result = database.execute(min_date)

In [10]:
min_date_range = pd.read_sql(min_date, con = database)
min_date_range.head()

          min
0  2019-05-01

In [11]:
max_date = '''
SELECT MAX(startdate)
FROM trips;
'''

result = database.execute(max_date)

In [12]:
max_date_range = pd.read_sql(max_date, con = database)
max_date_range.head()

          max
0  2019-07-31

In [13]:
min_pub_date = '''
SELECT MIN(pubdatetime)
FROM scooters;
'''
result = database.execute(min_pub_date)

In [14]:
earliest_pubdate = pd.read_sql(min_pub_date, con = database)
earliest_pubdate.head()

                      min
0 2019-05-01 00:01:41.247

In [15]:
max_end_date = '''
SELECT MAX(enddate)
FROM trips;
'''

result = database.execute(max_end_date)

In [16]:
highest_end_date = pd.read_sql(max_end_date, con = database)
highest_end_date.head()

          max
0  2019-08-01

- Is time represented with am/pm or using 24 hour values in each of the columns that include time?

- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [17]:
avg_time = '''
SELECT AVG(starttime)
FROM trips;
'''
result = database.execute(avg_time)

In [18]:
timestamp = pd.read_sql(avg_time, con = database)
timestamp.head()

                     avg
0 0 days 14:21:35.504024

 What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [19]:
max_lat = '''
SELECT MAX(latitude)
FROM scooters;
'''
result = database.execute(max_lat)

high_lat_range = pd.read_sql(max_lat, con = database)
high_lat_range.head()

            max
0  3.609874e+06

In [20]:
min_lat = '''
SELECT MIN(latitude)
FROM scooters;
'''
result = database.execute(min_lat)

low_lat_range = pd.read_sql(min_lat, con = database)
low_lat_range.head()

   min
0  0.0

-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [21]:
trip_range = '''
SELECT MIN(tripduration) as min_duration, MAX(tripduration) as max_duration
FROM trips;
'''
result = database.execute(trip_range)

range = pd.read_sql(trip_range, con = database)
range.head()

   min_duration  max_duration
0    -19.358267      512619.0

In [22]:
trip_distance = '''
SELECT MIN(tripdistance) as min_distance, MAX(tripduration) as max_distance
FROM trips;
'''
result = database.execute(trip_distance)

distance = pd.read_sql(trip_distance, con = database)
distance.head()

   min_distance  max_distance
0   -20324803.8      512619.0

- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

- What values are there in the sumdgroup column? Are there any that are not of interest for this project?